HloModule jit_t5_forward, entry_computation_layout={(s32[2,64]{1,0}, s32[2,64]{1,0}, s32[2,32]{1,0}, s32[2,32]{1,0})->f32[2,32,768]{2,1,0}}

_where.330 {
  Arg_0.326 = pred[2,64]{1,0} parameter(0)
  Arg_1.327 = s32[2,64]{1,0} parameter(1)
  Arg_2.328 = s32[2,64]{1,0} parameter(2)
  ROOT select.329 = s32[2,64]{1,0} select(Arg_0.326, Arg_1.327, Arg_2.328)
}

region_0.339 {
  Arg_0.336 = pred[] parameter(0)
  Arg_1.337 = pred[] parameter(1)
  ROOT and.338 = pred[] and(Arg_0.336, Arg_1.337)
}

_take.344 {
  Arg_1.312 = s32[2,64]{1,0} parameter(1)
  constant.322 = s32[] constant(0)
  broadcast.323 = s32[2,64]{1,0} broadcast(constant.322), dimensions={}
  compare.324 = pred[2,64]{1,0} compare(Arg_1.312, broadcast.323), direction=LT
  constant.319 = s32[] constant(32128)
  broadcast.320 = s32[2,64]{1,0} broadcast(constant.319), dimensions={}
  add.325 = s32[2,64]{1,0} add(Arg_1.312, broadcast.320)
  call.331 = s32[2,64]{1,0} call(compare.324, add.325, Arg_1.312), to_apply=_where.330
  reshape.332 = s32[2,64,1]{2,1,0} reshape(call.331)
  constant.317 = s32[] constant(0)
  broadcast.318 = s32[2,64,1]{2,1,0} broadcast(constant.317), dimensions={}
  compare.333 = pred[2,64,1]{2,1,0} compare(reshape.332, broadcast.318), direction=GE
  constant.315 = s32[] constant(32127)
  broadcast.316 = s32[2,64,1]{2,1,0} broadcast(constant.315), dimensions={}
  compare.334 = pred[2,64,1]{2,1,0} compare(reshape.332, broadcast.316), direction=LE
  and.335 = pred[2,64,1]{2,1,0} and(compare.333, compare.334)
  constant.321 = pred[] constant(true)
  reduce.340 = pred[2,64]{1,0} reduce(and.335, constant.321), dimensions={2}, to_apply=region_0.339
  broadcast.342 = pred[2,64,768]{2,1,0} broadcast(reduce.340), dimensions={0,1}
  Arg_0.311 = f32[32128,768]{1,0} parameter(0)
  gather.341 = f32[2,64,768]{2,1,0} gather(Arg_0.311, reshape.332), offset_dims={2}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=2, slice_sizes={1,768}
  constant.313 = f32[] constant(nan)
  broadcast.314 = f32[2,64,768]{2,1,0} broadcast(constant.313), dimensions={}
  ROOT select.343 = f32[2,64,768]{2,1,0} select(broadcast.342, gather.341, broadcast.314)
}

region_1.350 {
  Arg_0.347 = f32[] parameter(0)
  Arg_1.348 = f32[] parameter(1)
  ROOT add.349 = f32[] add(Arg_0.347, Arg_1.348)
}

clip.401 {
  Arg_1.397 = s32[] parameter(1)
  convert.398 = f32[] convert(Arg_1.397)
  broadcast.399 = f32[64,64]{1,0} broadcast(convert.398), dimensions={}
  Arg_0.396 = f32[64,64]{1,0} parameter(0)
  ROOT minimum.400 = f32[64,64]{1,0} minimum(broadcast.399, Arg_0.396)
}

_where_0.408 {
  Arg_0.403 = pred[64,64]{1,0} parameter(0)
  Arg_1.404 = s32[64,64]{1,0} parameter(1)
  convert.406 = f32[64,64]{1,0} convert(Arg_1.404)
  Arg_2.405 = f32[64,64]{1,0} parameter(2)
  ROOT select.407 = f32[64,64]{1,0} select(Arg_0.403, convert.406, Arg_2.405)
}

_where_2.432 {
  Arg_0.428 = pred[64,64]{1,0} parameter(0)
  Arg_1.429 = s32[64,64]{1,0} parameter(1)
  Arg_2.430 = s32[64,64]{1,0} parameter(2)
  ROOT select.431 = s32[64,64]{1,0} select(Arg_0.428, Arg_1.429, Arg_2.430)
}

region_2.441 {
  Arg_0.438 = pred[] parameter(0)
  Arg_1.439 = pred[] parameter(1)
  ROOT and.440 = pred[] and(Arg_0.438, Arg_1.439)
}

_take_1.446 {
  Arg_1.414 = s32[64,64]{1,0} parameter(1)
  constant.424 = s32[] constant(0)
  broadcast.425 = s32[64,64]{1,0} broadcast(constant.424), dimensions={}
  compare.426 = pred[64,64]{1,0} compare(Arg_1.414, broadcast.425), direction=LT
  constant.421 = s32[] constant(32)
  broadcast.422 = s32[64,64]{1,0} broadcast(constant.421), dimensions={}
  add.427 = s32[64,64]{1,0} add(Arg_1.414, broadcast.422)
  call.433 = s32[64,64]{1,0} call(compare.426, add.427, Arg_1.414), to_apply=_where_2.432
  reshape.434 = s32[64,64,1]{2,1,0} reshape(call.433)
  constant.419 = s32[] constant(0)
  broadcast.420 = s32[64,64,1]{2,1,0} broadcast(constant.419), dimensions={}
  compare.435 = pred[64,64,1]{2,1,0} compare(reshape.434, broadcast.420), direction=GE
  constant.417 = s32[] constant(31)
  broadcast.418 = s32[64,64,1]{2,1,0} broadcast(constant.417), dimensions={}
  compare.436 = pred[64,64,1]{2,1,0} compare(reshape.434, broadcast.418), direction=LE
  and.437 = pred[64,64,1]{2,1,0} and(compare.435, compare.436)
  constant.423 = pred[] constant(true)
  reduce.442 = pred[64,64]{1,0} reduce(and.437, constant.423), dimensions={2}, to_apply=region_2.441
  broadcast.444 = pred[64,64,12]{2,1,0} broadcast(reduce.442), dimensions={0,1}
  Arg_0.413 = f32[32,12]{1,0} parameter(0)
  gather.443 = f32[64,64,12]{2,1,0} gather(Arg_0.413, reshape.434), offset_dims={2}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=2, slice_sizes={1,12}
  constant.415 = f32[] constant(nan)
  broadcast.416 = f32[64,64,12]{2,1,0} broadcast(constant.415), dimensions={}
  ROOT select.445 = f32[64,64,12]{2,1,0} select(broadcast.444, gather.443, broadcast.416)
}

region_3.463 {
  Arg_0.460 = f32[] parameter(0)
  Arg_1.461 = f32[] parameter(1)
  ROOT maximum.462 = f32[] maximum(Arg_0.460, Arg_1.461)
}

region_4.475 {
  Arg_0.472 = f32[] parameter(0)
  Arg_1.473 = f32[] parameter(1)
  ROOT add.474 = f32[] add(Arg_0.472, Arg_1.473)
}

region_5.491 {
  Arg_0.488 = f32[] parameter(0)
  Arg_1.489 = f32[] parameter(1)
  ROOT add.490 = f32[] add(Arg_0.488, Arg_1.489)
}

relu.510 {
  Arg_0.506 = f32[2,64,3072]{2,1,0} parameter(0)
  constant.507 = f32[] constant(0)
  broadcast.508 = f32[2,64,3072]{2,1,0} broadcast(constant.507), dimensions={}
  ROOT maximum.509 = f32[2,64,3072]{2,1,0} maximum(Arg_0.506, broadcast.508)
}

region_6.518 {
  Arg_0.515 = f32[] parameter(0)
  Arg_1.516 = f32[] parameter(1)
  ROOT add.517 = f32[] add(Arg_0.515, Arg_1.516)
}

region_7.545 {
  Arg_0.542 = f32[] parameter(0)
  Arg_1.543 = f32[] parameter(1)
  ROOT maximum.544 = f32[] maximum(Arg_0.542, Arg_1.543)
}

region_8.557 {
  Arg_0.554 = f32[] parameter(0)
  Arg_1.555 = f32[] parameter(1)
  ROOT add.556 = f32[] add(Arg_0.554, Arg_1.555)
}

region_9.573 {
  Arg_0.570 = f32[] parameter(0)
  Arg_1.571 = f32[] parameter(1)
  ROOT add.572 = f32[] add(Arg_0.570, Arg_1.571)
}

region_10.595 {
  Arg_0.592 = f32[] parameter(0)
  Arg_1.593 = f32[] parameter(1)
  ROOT add.594 = f32[] add(Arg_0.592, Arg_1.593)
}

region_11.622 {
  Arg_0.619 = f32[] parameter(0)
  Arg_1.620 = f32[] parameter(1)
  ROOT maximum.621 = f32[] maximum(Arg_0.619, Arg_1.620)
}

region_12.634 {
  Arg_0.631 = f32[] parameter(0)
  Arg_1.632 = f32[] parameter(1)
  ROOT add.633 = f32[] add(Arg_0.631, Arg_1.632)
}

region_13.650 {
  Arg_0.647 = f32[] parameter(0)
  Arg_1.648 = f32[] parameter(1)
  ROOT add.649 = f32[] add(Arg_0.647, Arg_1.648)
}

region_14.672 {
  Arg_0.669 = f32[] parameter(0)
  Arg_1.670 = f32[] parameter(1)
  ROOT add.671 = f32[] add(Arg_0.669, Arg_1.670)
}

region_15.699 {
  Arg_0.696 = f32[] parameter(0)
  Arg_1.697 = f32[] parameter(1)
  ROOT maximum.698 = f32[] maximum(Arg_0.696, Arg_1.697)
}

region_16.711 {
  Arg_0.708 = f32[] parameter(0)
  Arg_1.709 = f32[] parameter(1)
  ROOT add.710 = f32[] add(Arg_0.708, Arg_1.709)
}

region_17.727 {
  Arg_0.724 = f32[] parameter(0)
  Arg_1.725 = f32[] parameter(1)
  ROOT add.726 = f32[] add(Arg_0.724, Arg_1.725)
}

region_18.749 {
  Arg_0.746 = f32[] parameter(0)
  Arg_1.747 = f32[] parameter(1)
  ROOT add.748 = f32[] add(Arg_0.746, Arg_1.747)
}

region_19.776 {
  Arg_0.773 = f32[] parameter(0)
  Arg_1.774 = f32[] parameter(1)
  ROOT maximum.775 = f32[] maximum(Arg_0.773, Arg_1.774)
}

region_20.788 {
  Arg_0.785 = f32[] parameter(0)
  Arg_1.786 = f32[] parameter(1)
  ROOT add.787 = f32[] add(Arg_0.785, Arg_1.786)
}

region_21.804 {
  Arg_0.801 = f32[] parameter(0)
  Arg_1.802 = f32[] parameter(1)
  ROOT add.803 = f32[] add(Arg_0.801, Arg_1.802)
}

region_22.826 {
  Arg_0.823 = f32[] parameter(0)
  Arg_1.824 = f32[] parameter(1)
  ROOT add.825 = f32[] add(Arg_0.823, Arg_1.824)
}

region_23.853 {
  Arg_0.850 = f32[] parameter(0)
  Arg_1.851 = f32[] parameter(1)
  ROOT maximum.852 = f32[] maximum(Arg_0.850, Arg_1.851)
}

region_24.865 {
  Arg_0.862 = f32[] parameter(0)
  Arg_1.863 = f32[] parameter(1)
  ROOT add.864 = f32[] add(Arg_0.862, Arg_1.863)
}

region_25.881 {
  Arg_0.878 = f32[] parameter(0)
  Arg_1.879 = f32[] parameter(1)
  ROOT add.880 = f32[] add(Arg_0.878, Arg_1.879)
}

region_26.903 {
  Arg_0.900 = f32[] parameter(0)
  Arg_1.901 = f32[] parameter(1)
  ROOT add.902 = f32[] add(Arg_0.900, Arg_1.901)
}

region_27.930 {
  Arg_0.927 = f32[] parameter(0)
  Arg_1.928 = f32[] parameter(1)
  ROOT maximum.929 = f32[] maximum(Arg_0.927, Arg_1.928)
}

region_28.942 {
  Arg_0.939 = f32[] parameter(0)
  Arg_1.940 = f32[] parameter(1)
  ROOT add.941 = f32[] add(Arg_0.939, Arg_1.940)
}

region_29.958 {
  Arg_0.955 = f32[] parameter(0)
  Arg_1.956 = f32[] parameter(1)
  ROOT add.957 = f32[] add(Arg_0.955, Arg_1.956)
}

region_30.980 {
  Arg_0.977 = f32[] parameter(0)
  Arg_1.978 = f32[] parameter(1)
  ROOT add.979 = f32[] add(Arg_0.977, Arg_1.978)
}

region_31.1007 {
  Arg_0.1004 = f32[] parameter(0)
  Arg_1.1005 = f32[] parameter(1)
  ROOT maximum.1006 = f32[] maximum(Arg_0.1004, Arg_1.1005)
}

region_32.1019 {
  Arg_0.1016 = f32[] parameter(0)
  Arg_1.1017 = f32[] parameter(1)
  ROOT add.1018 = f32[] add(Arg_0.1016, Arg_1.1017)
}

region_33.1035 {
  Arg_0.1032 = f32[] parameter(0)
  Arg_1.1033 = f32[] parameter(1)
  ROOT add.1034 = f32[] add(Arg_0.1032, Arg_1.1033)
}

region_34.1057 {
  Arg_0.1054 = f32[] parameter(0)
  Arg_1.1055 = f32[] parameter(1)
  ROOT add.1056 = f32[] add(Arg_0.1054, Arg_1.1055)
}

region_35.1084 {
  Arg_0.1081 = f32[] parameter(0)
  Arg_1.1082 = f32[] parameter(1)
  ROOT maximum.1083 = f32[] maximum(Arg_0.1081, Arg_1.1082)
}

region_36.1096 {
  Arg_0.1093 = f32[] parameter(0)
  Arg_1.1094 = f32[] parameter(1)
  ROOT add.1095 = f32[] add(Arg_0.1093, Arg_1.1094)
}

region_37.1112 {
  Arg_0.1109 = f32[] parameter(0)
  Arg_1.1110 = f32[] parameter(1)
  ROOT add.1111 = f32[] add(Arg_0.1109, Arg_1.1110)
}

region_38.1134 {
  Arg_0.1131 = f32[] parameter(0)
  Arg_1.1132 = f32[] parameter(1)
  ROOT add.1133 = f32[] add(Arg_0.1131, Arg_1.1132)
}

region_39.1161 {
  Arg_0.1158 = f32[] parameter(0)
  Arg_1.1159 = f32[] parameter(1)
  ROOT maximum.1160 = f32[] maximum(Arg_0.1158, Arg_1.1159)
}

region_40.1173 {
  Arg_0.1170 = f32[] parameter(0)
  Arg_1.1171 = f32[] parameter(1)
  ROOT add.1172 = f32[] add(Arg_0.1170, Arg_1.1171)
}

region_41.1189 {
  Arg_0.1186 = f32[] parameter(0)
  Arg_1.1187 = f32[] parameter(1)
  ROOT add.1188 = f32[] add(Arg_0.1186, Arg_1.1187)
}

region_42.1211 {
  Arg_0.1208 = f32[] parameter(0)
  Arg_1.1209 = f32[] parameter(1)
  ROOT add.1210 = f32[] add(Arg_0.1208, Arg_1.1209)
}

region_43.1238 {
  Arg_0.1235 = f32[] parameter(0)
  Arg_1.1236 = f32[] parameter(1)
  ROOT maximum.1237 = f32[] maximum(Arg_0.1235, Arg_1.1236)
}

region_44.1250 {
  Arg_0.1247 = f32[] parameter(0)
  Arg_1.1248 = f32[] parameter(1)
  ROOT add.1249 = f32[] add(Arg_0.1247, Arg_1.1248)
}

region_45.1266 {
  Arg_0.1263 = f32[] parameter(0)
  Arg_1.1264 = f32[] parameter(1)
  ROOT add.1265 = f32[] add(Arg_0.1263, Arg_1.1264)
}

region_46.1288 {
  Arg_0.1285 = f32[] parameter(0)
  Arg_1.1286 = f32[] parameter(1)
  ROOT add.1287 = f32[] add(Arg_0.1285, Arg_1.1286)
}

region_47.1315 {
  Arg_0.1312 = f32[] parameter(0)
  Arg_1.1313 = f32[] parameter(1)
  ROOT maximum.1314 = f32[] maximum(Arg_0.1312, Arg_1.1313)
}

region_48.1327 {
  Arg_0.1324 = f32[] parameter(0)
  Arg_1.1325 = f32[] parameter(1)
  ROOT add.1326 = f32[] add(Arg_0.1324, Arg_1.1325)
}

region_49.1343 {
  Arg_0.1340 = f32[] parameter(0)
  Arg_1.1341 = f32[] parameter(1)
  ROOT add.1342 = f32[] add(Arg_0.1340, Arg_1.1341)
}

region_50.1365 {
  Arg_0.1362 = f32[] parameter(0)
  Arg_1.1363 = f32[] parameter(1)
  ROOT add.1364 = f32[] add(Arg_0.1362, Arg_1.1363)
}

_where_4.1398 {
  Arg_0.1394 = pred[2,32]{1,0} parameter(0)
  Arg_1.1395 = s32[2,32]{1,0} parameter(1)
  Arg_2.1396 = s32[2,32]{1,0} parameter(2)
  ROOT select.1397 = s32[2,32]{1,0} select(Arg_0.1394, Arg_1.1395, Arg_2.1396)
}

region_51.1407 {
  Arg_0.1404 = pred[] parameter(0)
  Arg_1.1405 = pred[] parameter(1)
  ROOT and.1406 = pred[] and(Arg_0.1404, Arg_1.1405)
}

_take_3.1412 {
  Arg_1.1380 = s32[2,32]{1,0} parameter(1)
  constant.1390 = s32[] constant(0)
  broadcast.1391 = s32[2,32]{1,0} broadcast(constant.1390), dimensions={}
  compare.1392 = pred[2,32]{1,0} compare(Arg_1.1380, broadcast.1391), direction=LT
  constant.1387 = s32[] constant(32128)
  broadcast.1388 = s32[2,32]{1,0} broadcast(constant.1387), dimensions={}
  add.1393 = s32[2,32]{1,0} add(Arg_1.1380, broadcast.1388)
  call.1399 = s32[2,32]{1,0} call(compare.1392, add.1393, Arg_1.1380), to_apply=_where_4.1398
  reshape.1400 = s32[2,32,1]{2,1,0} reshape(call.1399)
  constant.1385 = s32[] constant(0)
  broadcast.1386 = s32[2,32,1]{2,1,0} broadcast(constant.1385), dimensions={}
  compare.1401 = pred[2,32,1]{2,1,0} compare(reshape.1400, broadcast.1386), direction=GE
  constant.1383 = s32[] constant(32127)
  broadcast.1384 = s32[2,32,1]{2,1,0} broadcast(constant.1383), dimensions={}
  compare.1402 = pred[2,32,1]{2,1,0} compare(reshape.1400, broadcast.1384), direction=LE
  and.1403 = pred[2,32,1]{2,1,0} and(compare.1401, compare.1402)
  constant.1389 = pred[] constant(true)
  reduce.1408 = pred[2,32]{1,0} reduce(and.1403, constant.1389), dimensions={2}, to_apply=region_51.1407
  broadcast.1410 = pred[2,32,768]{2,1,0} broadcast(reduce.1408), dimensions={0,1}
  Arg_0.1379 = f32[32128,768]{1,0} parameter(0)
  gather.1409 = f32[2,32,768]{2,1,0} gather(Arg_0.1379, reshape.1400), offset_dims={2}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=2, slice_sizes={1,768}
  constant.1381 = f32[] constant(nan)
  broadcast.1382 = f32[2,32,768]{2,1,0} broadcast(constant.1381), dimensions={}
  ROOT select.1411 = f32[2,32,768]{2,1,0} select(broadcast.1410, gather.1409, broadcast.1382)
}

region_52.1418 {
  Arg_0.1415 = f32[] parameter(0)
  Arg_1.1416 = f32[] parameter(1)
  ROOT add.1417 = f32[] add(Arg_0.1415, Arg_1.1416)
}

clip_5.1477 {
  Arg_1.1474 = s32[] parameter(1)
  broadcast.1475 = s32[32,32]{1,0} broadcast(Arg_1.1474), dimensions={}
  Arg_0.1473 = s32[32,32]{1,0} parameter(0)
  ROOT minimum.1476 = s32[32,32]{1,0} minimum(broadcast.1475, Arg_0.1473)
}

clip_6.1492 {
  Arg_1.1488 = s32[] parameter(1)
  convert.1489 = f32[] convert(Arg_1.1488)
  broadcast.1490 = f32[32,32]{1,0} broadcast(convert.1489), dimensions={}
  Arg_0.1487 = f32[32,32]{1,0} parameter(0)
  ROOT minimum.1491 = f32[32,32]{1,0} minimum(broadcast.1490, Arg_0.1487)
}

_where_7.1499 {
  Arg_0.1494 = pred[32,32]{1,0} parameter(0)
  Arg_1.1495 = s32[32,32]{1,0} parameter(1)
  convert.1497 = f32[32,32]{1,0} convert(Arg_1.1495)
  Arg_2.1496 = f32[32,32]{1,0} parameter(2)
  ROOT select.1498 = f32[32,32]{1,0} select(Arg_0.1494, convert.1497, Arg_2.1496)
}

_where_9.1521 {
  Arg_0.1517 = pred[32,32]{1,0} parameter(0)
  Arg_1.1518 = s32[32,32]{1,0} parameter(1)
  Arg_2.1519 = s32[32,32]{1,0} parameter(2)
  ROOT select.1520 = s32[32,32]{1,0} select(Arg_0.1517, Arg_1.1518, Arg_2.1519)
}

region_53.1530 {
  Arg_0.1527 = pred[] parameter(0)
  Arg_1.1528 = pred[] parameter(1)
  ROOT and.1529 = pred[] and(Arg_0.1527, Arg_1.1528)
}

_take_8.1535 {
  Arg_1.1503 = s32[32,32]{1,0} parameter(1)
  constant.1513 = s32[] constant(0)
  broadcast.1514 = s32[32,32]{1,0} broadcast(constant.1513), dimensions={}
  compare.1515 = pred[32,32]{1,0} compare(Arg_1.1503, broadcast.1514), direction=LT
  constant.1510 = s32[] constant(32)
  broadcast.1511 = s32[32,32]{1,0} broadcast(constant.1510), dimensions={}
  add.1516 = s32[32,32]{1,0} add(Arg_1.1503, broadcast.1511)
  call.1522 = s32[32,32]{1,0} call(compare.1515, add.1516, Arg_1.1503), to_apply=_where_9.1521
  reshape.1523 = s32[32,32,1]{2,1,0} reshape(call.1522)
  constant.1508 = s32[] constant(0)
  broadcast.1509 = s32[32,32,1]{2,1,0} broadcast(constant.1508), dimensions={}
  compare.1524 = pred[32,32,1]{2,1,0} compare(reshape.1523, broadcast.1509), direction=GE
  constant.1506 = s32[] constant(31)
  broadcast.1507 = s32[32,32,1]{2,1,0} broadcast(constant.1506), dimensions={}
  compare.1525 = pred[32,32,1]{2,1,0} compare(reshape.1523, broadcast.1507), direction=LE
  and.1526 = pred[32,32,1]{2,1,0} and(compare.1524, compare.1525)
  constant.1512 = pred[] constant(true)
  reduce.1531 = pred[32,32]{1,0} reduce(and.1526, constant.1512), dimensions={2}, to_apply=region_53.1530
  broadcast.1533 = pred[32,32,12]{2,1,0} broadcast(reduce.1531), dimensions={0,1}
  Arg_0.1502 = f32[32,12]{1,0} parameter(0)
  gather.1532 = f32[32,32,12]{2,1,0} gather(Arg_0.1502, reshape.1523), offset_dims={2}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=2, slice_sizes={1,12}
  constant.1504 = f32[] constant(nan)
  broadcast.1505 = f32[32,32,12]{2,1,0} broadcast(constant.1504), dimensions={}
  ROOT select.1534 = f32[32,32,12]{2,1,0} select(broadcast.1533, gather.1532, broadcast.1505)
}

region_54.1552 {
  Arg_0.1549 = f32[] parameter(0)
  Arg_1.1550 = f32[] parameter(1)
  ROOT maximum.1551 = f32[] maximum(Arg_0.1549, Arg_1.1550)
}

region_55.1564 {
  Arg_0.1561 = f32[] parameter(0)
  Arg_1.1562 = f32[] parameter(1)
  ROOT add.1563 = f32[] add(Arg_0.1561, Arg_1.1562)
}

region_56.1580 {
  Arg_0.1577 = f32[] parameter(0)
  Arg_1.1578 = f32[] parameter(1)
  ROOT add.1579 = f32[] add(Arg_0.1577, Arg_1.1578)
}

region_57.1613 {
  Arg_0.1610 = f32[] parameter(0)
  Arg_1.1611 = f32[] parameter(1)
  ROOT maximum.1612 = f32[] maximum(Arg_0.1610, Arg_1.1611)
}

region_58.1625 {
  Arg_0.1622 = f32[] parameter(0)
  Arg_1.1623 = f32[] parameter(1)
  ROOT add.1624 = f32[] add(Arg_0.1622, Arg_1.1623)
}

region_59.1641 {
  Arg_0.1638 = f32[] parameter(0)
  Arg_1.1639 = f32[] parameter(1)
  ROOT add.1640 = f32[] add(Arg_0.1638, Arg_1.1639)
}

relu_10.1660 {
  Arg_0.1656 = f32[2,32,3072]{2,1,0} parameter(0)
  constant.1657 = f32[] constant(0)
  broadcast.1658 = f32[2,32,3072]{2,1,0} broadcast(constant.1657), dimensions={}
  ROOT maximum.1659 = f32[2,32,3072]{2,1,0} maximum(Arg_0.1656, broadcast.1658)
}

region_60.1668 {
  Arg_0.1665 = f32[] parameter(0)
  Arg_1.1666 = f32[] parameter(1)
  ROOT add.1667 = f32[] add(Arg_0.1665, Arg_1.1666)
}

region_61.1695 {
  Arg_0.1692 = f32[] parameter(0)
  Arg_1.1693 = f32[] parameter(1)
  ROOT maximum.1694 = f32[] maximum(Arg_0.1692, Arg_1.1693)
}

region_62.1707 {
  Arg_0.1704 = f32[] parameter(0)
  Arg_1.1705 = f32[] parameter(1)
  ROOT add.1706 = f32[] add(Arg_0.1704, Arg_1.1705)
}

region_63.1723 {
  Arg_0.1720 = f32[] parameter(0)
  Arg_1.1721 = f32[] parameter(1)
  ROOT add.1722 = f32[] add(Arg_0.1720, Arg_1.1721)
}

region_64.1753 {
  Arg_0.1750 = f32[] parameter(0)
  Arg_1.1751 = f32[] parameter(1)
  ROOT maximum.1752 = f32[] maximum(Arg_0.1750, Arg_1.1751)
}

region_65.1765 {
  Arg_0.1762 = f32[] parameter(0)
  Arg_1.1763 = f32[] parameter(1)
  ROOT add.1764 = f32[] add(Arg_0.1762, Arg_1.1763)
}

region_66.1781 {
  Arg_0.1778 = f32[] parameter(0)
  Arg_1.1779 = f32[] parameter(1)
  ROOT add.1780 = f32[] add(Arg_0.1778, Arg_1.1779)
}

region_67.1803 {
  Arg_0.1800 = f32[] parameter(0)
  Arg_1.1801 = f32[] parameter(1)
  ROOT add.1802 = f32[] add(Arg_0.1800, Arg_1.1801)
}

region_68.1830 {
  Arg_0.1827 = f32[] parameter(0)
  Arg_1.1828 = f32[] parameter(1)
  ROOT maximum.1829 = f32[] maximum(Arg_0.1827, Arg_1.1828)
}

region_69.1842 {
  Arg_0.1839 = f32[] parameter(0)
  Arg_1.1840 = f32[] parameter(1)
  ROOT add.1841 = f32[] add(Arg_0.1839, Arg_1.1840)
}

region_70.1858 {
  Arg_0.1855 = f32[] parameter(0)
  Arg_1.1856 = f32[] parameter(1)
  ROOT add.1857 = f32[] add(Arg_0.1855, Arg_1.1856)
}

region_71.1888 {
  Arg_0.1885 = f32[] parameter(0)
  Arg_1.1886 = f32[] parameter(1)
  ROOT maximum.1887 = f32[] maximum(Arg_0.1885, Arg_1.1886)
}

region_72.1900 {
  Arg_0.1897 = f32[] parameter(0)
  Arg_1.1898 = f32[] parameter(1)
  ROOT add.1899 = f32[] add(Arg_0.1897, Arg_1.1898)
}

region_73.1916 {
  Arg_0.1913 = f32[] parameter(0)
  Arg_1.1914 = f32[] parameter(1)
  ROOT add.1915 = f32[] add(Arg_0.1913, Arg_1.1914)
}

region_74.1938 {
  Arg_0.1935 = f32[] parameter(0)
  Arg_1.1936 = f32[] parameter(1)
  ROOT add.1937 = f32[] add(Arg_0.1935, Arg_1.1936)
}

region_75.1965 {
  Arg_0.1962 = f32[] parameter(0)
  Arg_1.1963 = f32[] parameter(1)
  ROOT maximum.1964 = f32[] maximum(Arg_0.1962, Arg_1.1963)
}

region_76.1977 {
  Arg_0.1974 = f32[] parameter(0)
  Arg_1.1975 = f32[] parameter(1)
  ROOT add.1976 = f32[] add(Arg_0.1974, Arg_1.1975)
}

region_77.1993 {
  Arg_0.1990 = f32[] parameter(0)
  Arg_1.1991 = f32[] parameter(1)
  ROOT add.1992 = f32[] add(Arg_0.1990, Arg_1.1991)
}

region_78.2023 {
  Arg_0.2020 = f32[] parameter(0)
  Arg_1.2021 = f32[] parameter(1)
  ROOT maximum.2022 = f32[] maximum(Arg_0.2020, Arg_1.2021)
}

region_79.2035 {
  Arg_0.2032 = f32[] parameter(0)
  Arg_1.2033 = f32[] parameter(1)
  ROOT add.2034 = f32[] add(Arg_0.2032, Arg_1.2033)
}

region_80.2051 {
  Arg_0.2048 = f32[] parameter(0)
  Arg_1.2049 = f32[] parameter(1)
  ROOT add.2050 = f32[] add(Arg_0.2048, Arg_1.2049)
}

region_81.2073 {
  Arg_0.2070 = f32[] parameter(0)
  Arg_1.2071 = f32[] parameter(1)
  ROOT add.2072 = f32[] add(Arg_0.2070, Arg_1.2071)
}

region_82.2100 {
  Arg_0.2097 = f32[] parameter(0)
  Arg_1.2098 = f32[] parameter(1)
  ROOT maximum.2099 = f32[] maximum(Arg_0.2097, Arg_1.2098)
}

region_83.2112 {
  Arg_0.2109 = f32[] parameter(0)
  Arg_1.2110 = f32[] parameter(1)
  ROOT add.2111 = f32[] add(Arg_0.2109, Arg_1.2110)
}

region_84.2128 {
  Arg_0.2125 = f32[] parameter(0)
  Arg_1.2126 = f32[] parameter(1)
  ROOT add.2127 = f32[] add(Arg_0.2125, Arg_1.2126)
}

region_85.2158 {
  Arg_0.2155 = f32[] parameter(0)
  Arg_1.2156 = f32[] parameter(1)
  ROOT maximum.2157 = f32[] maximum(Arg_0.2155, Arg_1.2156)
}

region_86.2170 {
  Arg_0.2167 = f32[] parameter(0)
  Arg_1.2168 = f32[] parameter(1)
  ROOT add.2169 = f32[] add(Arg_0.2167, Arg_1.2168)
}

region_87.2186 {
  Arg_0.2183 = f32[] parameter(0)
  Arg_1.2184 = f32[] parameter(1)
  ROOT add.2185 = f32[] add(Arg_0.2183, Arg_1.2184)
}

region_88.2208 {
  Arg_0.2205 = f32[] parameter(0)
  Arg_1.2206 = f32[] parameter(1)
  ROOT add.2207 = f32[] add(Arg_0.2205, Arg_1.2206)
}

region_89.2235 {
  Arg_0.2232 = f32[] parameter(0)
  Arg_1.2233 = f32[] parameter(1)
  ROOT maximum.2234 = f32[] maximum(Arg_0.2232, Arg_1.2233)
}

region_90.2247 {
  Arg_0.2244 = f32[] parameter(0)
  Arg_1.2245 = f32[] parameter(1)
  ROOT add.2246 = f32[] add(Arg_0.2244, Arg_1.2245)
}

region_91.2263 {
  Arg_0.2260 = f32[] parameter(0)
  Arg_1.2261 = f32[] parameter(1)
  ROOT add.2262 = f32[] add(Arg_0.2260, Arg_1.2261)
}

region_92.2293 {
  Arg_0.2290 = f32[] parameter(0)
  Arg_1.2291 = f32[] parameter(1)
  ROOT maximum.2292 = f32[] maximum(Arg_0.2290, Arg_1.2291)
}

region_93.2305 {
  Arg_0.2302 = f32[] parameter(0)
  Arg_1.2303 = f32[] parameter(1)
  ROOT add.2304 = f32[] add(Arg_0.2302, Arg_1.2303)
}

region_94.2321 {
  Arg_0.2318 = f32[] parameter(0)
  Arg_1.2319 = f32[] parameter(1)
  ROOT add.2320 = f32[] add(Arg_0.2318, Arg_1.2319)
}

region_95.2343 {
  Arg_0.2340 = f32[] parameter(0)
  Arg_1.2341 = f32[] parameter(1)
  ROOT add.2342 = f32[] add(Arg_0.2340, Arg_1.2341)
}

region_96.2370 {
  Arg_0.2367 = f32[] parameter(0)
  Arg_1.2368 = f32[] parameter(1)
  ROOT maximum.2369 = f32[] maximum(Arg_0.2367, Arg_1.2368)
}

region_97.2382 {
  Arg_0.2379 = f32[] parameter(0)
  Arg_1.2380 = f32[] parameter(1)
  ROOT add.2381 = f32[] add(Arg_0.2379, Arg_1.2380)
}

region_98.2398 {
  Arg_0.2395 = f32[] parameter(0)
  Arg_1.2396 = f32[] parameter(1)
  ROOT add.2397 = f32[] add(Arg_0.2395, Arg_1.2396)
}

region_99.2428 {
  Arg_0.2425 = f32[] parameter(0)
  Arg_1.2426 = f32[] parameter(1)
  ROOT maximum.2427 = f32[] maximum(Arg_0.2425, Arg_1.2426)
}

region_100.2440 {
  Arg_0.2437 = f32[] parameter(0)
  Arg_1.2438 = f32[] parameter(1)
  ROOT add.2439 = f32[] add(Arg_0.2437, Arg_1.2438)
}

region_101.2456 {
  Arg_0.2453 = f32[] parameter(0)
  Arg_1.2454 = f32[] parameter(1)
  ROOT add.2455 = f32[] add(Arg_0.2453, Arg_1.2454)
}

region_102.2478 {
  Arg_0.2475 = f32[] parameter(0)
  Arg_1.2476 = f32[] parameter(1)
  ROOT add.2477 = f32[] add(Arg_0.2475, Arg_1.2476)
}

region_103.2505 {
  Arg_0.2502 = f32[] parameter(0)
  Arg_1.2503 = f32[] parameter(1)
  ROOT maximum.2504 = f32[] maximum(Arg_0.2502, Arg_1.2503)
}

region_104.2517 {
  Arg_0.2514 = f32[] parameter(0)
  Arg_1.2515 = f32[] parameter(1)
  ROOT add.2516 = f32[] add(Arg_0.2514, Arg_1.2515)
}

region_105.2533 {
  Arg_0.2530 = f32[] parameter(0)
  Arg_1.2531 = f32[] parameter(1)
  ROOT add.2532 = f32[] add(Arg_0.2530, Arg_1.2531)
}

region_106.2563 {
  Arg_0.2560 = f32[] parameter(0)
  Arg_1.2561 = f32[] parameter(1)
  ROOT maximum.2562 = f32[] maximum(Arg_0.2560, Arg_1.2561)
}

region_107.2575 {
  Arg_0.2572 = f32[] parameter(0)
  Arg_1.2573 = f32[] parameter(1)
  ROOT add.2574 = f32[] add(Arg_0.2572, Arg_1.2573)
}

region_108.2591 {
  Arg_0.2588 = f32[] parameter(0)
  Arg_1.2589 = f32[] parameter(1)
  ROOT add.2590 = f32[] add(Arg_0.2588, Arg_1.2589)
}

region_109.2613 {
  Arg_0.2610 = f32[] parameter(0)
  Arg_1.2611 = f32[] parameter(1)
  ROOT add.2612 = f32[] add(Arg_0.2610, Arg_1.2611)
}

region_110.2640 {
  Arg_0.2637 = f32[] parameter(0)
  Arg_1.2638 = f32[] parameter(1)
  ROOT maximum.2639 = f32[] maximum(Arg_0.2637, Arg_1.2638)
}

region_111.2652 {
  Arg_0.2649 = f32[] parameter(0)
  Arg_1.2650 = f32[] parameter(1)
  ROOT add.2651 = f32[] add(Arg_0.2649, Arg_1.2650)
}

region_112.2668 {
  Arg_0.2665 = f32[] parameter(0)
  Arg_1.2666 = f32[] parameter(1)
  ROOT add.2667 = f32[] add(Arg_0.2665, Arg_1.2666)
}

region_113.2698 {
  Arg_0.2695 = f32[] parameter(0)
  Arg_1.2696 = f32[] parameter(1)
  ROOT maximum.2697 = f32[] maximum(Arg_0.2695, Arg_1.2696)
}

region_114.2710 {
  Arg_0.2707 = f32[] parameter(0)
  Arg_1.2708 = f32[] parameter(1)
  ROOT add.2709 = f32[] add(Arg_0.2707, Arg_1.2708)
}

region_115.2726 {
  Arg_0.2723 = f32[] parameter(0)
  Arg_1.2724 = f32[] parameter(1)
  ROOT add.2725 = f32[] add(Arg_0.2723, Arg_1.2724)
}

region_116.2748 {
  Arg_0.2745 = f32[] parameter(0)
  Arg_1.2746 = f32[] parameter(1)
  ROOT add.2747 = f32[] add(Arg_0.2745, Arg_1.2746)
}

region_117.2775 {
  Arg_0.2772 = f32[] parameter(0)
  Arg_1.2773 = f32[] parameter(1)
  ROOT maximum.2774 = f32[] maximum(Arg_0.2772, Arg_1.2773)
}

region_118.2787 {
  Arg_0.2784 = f32[] parameter(0)
  Arg_1.2785 = f32[] parameter(1)
  ROOT add.2786 = f32[] add(Arg_0.2784, Arg_1.2785)
}

region_119.2803 {
  Arg_0.2800 = f32[] parameter(0)
  Arg_1.2801 = f32[] parameter(1)
  ROOT add.2802 = f32[] add(Arg_0.2800, Arg_1.2801)
}

region_120.2833 {
  Arg_0.2830 = f32[] parameter(0)
  Arg_1.2831 = f32[] parameter(1)
  ROOT maximum.2832 = f32[] maximum(Arg_0.2830, Arg_1.2831)
}

region_121.2845 {
  Arg_0.2842 = f32[] parameter(0)
  Arg_1.2843 = f32[] parameter(1)
  ROOT add.2844 = f32[] add(Arg_0.2842, Arg_1.2843)
}

region_122.2861 {
  Arg_0.2858 = f32[] parameter(0)
  Arg_1.2859 = f32[] parameter(1)
  ROOT add.2860 = f32[] add(Arg_0.2858, Arg_1.2859)
}

region_123.2883 {
  Arg_0.2880 = f32[] parameter(0)
  Arg_1.2881 = f32[] parameter(1)
  ROOT add.2882 = f32[] add(Arg_0.2880, Arg_1.2881)
}

region_124.2910 {
  Arg_0.2907 = f32[] parameter(0)
  Arg_1.2908 = f32[] parameter(1)
  ROOT maximum.2909 = f32[] maximum(Arg_0.2907, Arg_1.2908)
}

region_125.2922 {
  Arg_0.2919 = f32[] parameter(0)
  Arg_1.2920 = f32[] parameter(1)
  ROOT add.2921 = f32[] add(Arg_0.2919, Arg_1.2920)
}

region_126.2938 {
  Arg_0.2935 = f32[] parameter(0)
  Arg_1.2936 = f32[] parameter(1)
  ROOT add.2937 = f32[] add(Arg_0.2935, Arg_1.2936)
}

region_127.2968 {
  Arg_0.2965 = f32[] parameter(0)
  Arg_1.2966 = f32[] parameter(1)
  ROOT maximum.2967 = f32[] maximum(Arg_0.2965, Arg_1.2966)
}

region_128.2980 {
  Arg_0.2977 = f32[] parameter(0)
  Arg_1.2978 = f32[] parameter(1)
  ROOT add.2979 = f32[] add(Arg_0.2977, Arg_1.2978)
}

region_129.2996 {
  Arg_0.2993 = f32[] parameter(0)
  Arg_1.2994 = f32[] parameter(1)
  ROOT add.2995 = f32[] add(Arg_0.2993, Arg_1.2994)
}

region_130.3018 {
  Arg_0.3015 = f32[] parameter(0)
  Arg_1.3016 = f32[] parameter(1)
  ROOT add.3017 = f32[] add(Arg_0.3015, Arg_1.3016)
}

region_131.3045 {
  Arg_0.3042 = f32[] parameter(0)
  Arg_1.3043 = f32[] parameter(1)
  ROOT maximum.3044 = f32[] maximum(Arg_0.3042, Arg_1.3043)
}

region_132.3057 {
  Arg_0.3054 = f32[] parameter(0)
  Arg_1.3055 = f32[] parameter(1)
  ROOT add.3056 = f32[] add(Arg_0.3054, Arg_1.3055)
}

region_133.3073 {
  Arg_0.3070 = f32[] parameter(0)
  Arg_1.3071 = f32[] parameter(1)
  ROOT add.3072 = f32[] add(Arg_0.3070, Arg_1.3071)
}

region_134.3103 {
  Arg_0.3100 = f32[] parameter(0)
  Arg_1.3101 = f32[] parameter(1)
  ROOT maximum.3102 = f32[] maximum(Arg_0.3100, Arg_1.3101)
}

region_135.3115 {
  Arg_0.3112 = f32[] parameter(0)
  Arg_1.3113 = f32[] parameter(1)
  ROOT add.3114 = f32[] add(Arg_0.3112, Arg_1.3113)
}

region_136.3131 {
  Arg_0.3128 = f32[] parameter(0)
  Arg_1.3129 = f32[] parameter(1)
  ROOT add.3130 = f32[] add(Arg_0.3128, Arg_1.3129)
}

region_137.3153 {
  Arg_0.3150 = f32[] parameter(0)
  Arg_1.3151 = f32[] parameter(1)
  ROOT add.3152 = f32[] add(Arg_0.3150, Arg_1.3151)
}

ENTRY main.3167 {
  constant.5 = f32[1,1,768]{2,1,0} constant({...})
  broadcast.3163 = f32[1,1,768]{2,1,0} broadcast(constant.5), dimensions={0,1,2}
  reshape.3164 = f32[768]{0} reshape(broadcast.3163)
  broadcast.3165 = f32[2,32,768]{2,1,0} broadcast(reshape.3164), dimensions={2}
  constant.116 = f32[32128,768]{1,0} constant({...})
  Arg_2.3 = s32[2,32]{1,0} parameter(2)
  call.1413 = f32[2,32,768]{2,1,0} call(constant.116, Arg_2.3), to_apply=_take_3.1412
  constant.57 = f32[1,1,768]{2,1,0} constant({...})
  broadcast.1428 = f32[1,1,768]{2,1,0} broadcast(constant.57), dimensions={0,1,2}
  reshape.1429 = f32[768]{0} reshape(broadcast.1428)
  broadcast.1430 = f32[2,32,768]{2,1,0} broadcast(reshape.1429), dimensions={2}
  multiply.1414 = f32[2,32,768]{2,1,0} multiply(call.1413, call.1413)
  constant.115 = f32[] constant(0)
  reduce.1419 = f32[2,32]{1,0} reduce(multiply.1414, constant.115), dimensions={2}, to_apply=region_52.1418
  reshape.1420 = f32[2,32,1]{2,1,0} reshape(reduce.1419)
  constant.60 = f32[] constant(768)
  broadcast.61 = f32[2,32,1]{2,1,0} broadcast(constant.60), dimensions={}
  divide.1421 = f32[2,32,1]{2,1,0} divide(reshape.1420, broadcast.61)
  constant.58 = f32[] constant(1e-06)
  broadcast.59 = f32[2,32,1]{2,1,0} broadcast(constant.58), dimensions={}
  add.1422 = f32[2,32,1]{2,1,0} add(divide.1421, broadcast.59)
  sqrt.1423 = f32[2,32,1]{2,1,0} sqrt(add.1422)
  broadcast.1424 = f32[2,32,1]{2,1,0} broadcast(sqrt.1423), dimensions={0,1,2}
  reshape.1425 = f32[2,32]{1,0} reshape(broadcast.1424)
  broadcast.1426 = f32[2,32,768]{2,1,0} broadcast(reshape.1425), dimensions={0,1}
  divide.1427 = f32[2,32,768]{2,1,0} divide(call.1413, broadcast.1426)
  multiply.1431 = f32[2,32,768]{2,1,0} multiply(broadcast.1430, divide.1427)
  constant.192 = f32[768,768]{1,0} constant({...})
  dot.1434 = f32[2,32,768]{2,1,0} dot(multiply.1431, constant.192), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  reshape.1437 = f32[2,32,12,64]{3,2,1,0} reshape(dot.1434)
  constant.190 = f32[768,768]{1,0} constant({...})
  dot.1432 = f32[2,32,768]{2,1,0} dot(multiply.1431, constant.190), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  reshape.1435 = f32[2,32,12,64]{3,2,1,0} reshape(dot.1432)
  constant.55 = f32[] constant(8)
  broadcast.56 = f32[2,32,12,64]{3,2,1,0} broadcast(constant.55), dimensions={}
  multiply.1438 = f32[2,32,12,64]{3,2,1,0} multiply(reshape.1435, broadcast.56)
  divide.1546 = f32[2,32,12,64]{3,2,1,0} divide(multiply.1438, broadcast.56)
  constant.191 = f32[768,768]{1,0} constant({...})
  dot.1433 = f32[2,32,768]{2,1,0} dot(multiply.1431, constant.191), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  reshape.1436 = f32[2,32,12,64]{3,2,1,0} reshape(dot.1433)
  dot.1547 = f32[2,12,32,32]{3,2,1,0} dot(divide.1546, reshape.1436), lhs_batch_dims={0,2}, lhs_contracting_dims={3}, rhs_batch_dims={0,2}, rhs_contracting_dims={3}
  constant.193 = f32[32,12]{1,0} constant({...})
  iota.1464 = s32[32]{0} iota(), iota_dimension=0
  reshape.1465 = s32[1,32]{1,0} reshape(iota.1464)
  broadcast.1466 = s32[1,32]{1,0} broadcast(reshape.1465), dimensions={0,1}
  reshape.1467 = s32[32]{0} reshape(broadcast.1466)
  broadcast.1468 = s32[32,32]{1,0} broadcast(reshape.1467), dimensions={1}
  iota.1462 = s32[32]{0} iota(), iota_dimension=0
  reshape.1463 = s32[32,1]{1,0} reshape(iota.1462)
  broadcast.1469 = s32[32,1]{1,0} broadcast(reshape.1463), dimensions={0,1}
  reshape.1470 = s32[32]{0} reshape(broadcast.1469)
  broadcast.1471 = s32[32,32]{1,0} broadcast(reshape.1470), dimensions={0}
  subtract.1472 = s32[32,32]{1,0} subtract(broadcast.1468, broadcast.1471)
  constant.114 = s32[] constant(0)
  call.1478 = s32[32,32]{1,0} call(subtract.1472, constant.114), to_apply=clip_5.1477
  negate.1479 = s32[32,32]{1,0} negate(call.1478)
  constant.47 = s32[] constant(16)
  broadcast.48 = s32[32,32]{1,0} broadcast(constant.47), dimensions={}
  compare.1480 = pred[32,32]{1,0} compare(negate.1479, broadcast.48), direction=LT
  convert.1481 = f32[32,32]{1,0} convert(negate.1479)
  constant.45 = f32[] constant(16)
  broadcast.46 = f32[32,32]{1,0} broadcast(constant.45), dimensions={}
  divide.1482 = f32[32,32]{1,0} divide(convert.1481, broadcast.46)
  log.1483 = f32[32,32]{1,0} log(divide.1482)
  constant.43 = f32[] constant(2.07944155)
  broadcast.44 = f32[32,32]{1,0} broadcast(constant.43), dimensions={}
  divide.1484 = f32[32,32]{1,0} divide(log.1483, broadcast.44)
  multiply.1485 = f32[32,32]{1,0} multiply(divide.1484, broadcast.46)
  add.1486 = f32[32,32]{1,0} add(multiply.1485, broadcast.46)
  constant.111 = s32[] constant(31)
  call.1493 = f32[32,32]{1,0} call(add.1486, constant.111), to_apply=clip_6.1492
  call.1500 = f32[32,32]{1,0} call(compare.1480, negate.1479, call.1493), to_apply=_where_7.1499
  convert.1501 = s32[32,32]{1,0} convert(call.1500)
  call.1536 = f32[32,32,12]{2,1,0} call(constant.193, convert.1501), to_apply=_take_8.1535
  transpose.1537 = f32[12,32,32]{0,2,1} transpose(call.1536), dimensions={2,0,1}
  reshape.1538 = f32[1,12,32,32]{3,2,1,0} reshape(transpose.1537)
  broadcast.1539 = f32[1,12,32,32]{3,2,1,0} broadcast(reshape.1538), dimensions={0,1,2,3}
  reshape.1540 = f32[12,32,32]{2,1,0} reshape(broadcast.1539)
  broadcast.1541 = f32[2,12,32,32]{3,2,1,0} broadcast(reshape.1540), dimensions={1,2,3}
  Arg_3.4 = s32[2,32]{1,0} parameter(3)
  reshape.1451 = s32[2,1,1,32]{3,2,1,0} reshape(Arg_3.4)
  broadcast.1452 = s32[2,1,1,32]{3,2,1,0} broadcast(reshape.1451), dimensions={0,1,2,3}
  reshape.1453 = s32[2,1,32]{2,1,0} reshape(broadcast.1452)
  broadcast.1454 = s32[2,1,32,32]{3,2,1,0} broadcast(reshape.1453), dimensions={0,1,3}
  constant.53 = s32[] constant(0)
  broadcast.54 = s32[2,1,32,32]{3,2,1,0} broadcast(constant.53), dimensions={}
  compare.1456 = pred[2,1,32,32]{3,2,1,0} compare(broadcast.1454, broadcast.54), direction=NE
  iota.1439 = s32[32]{0} iota(), iota_dimension=0
  broadcast.1440 = s32[2,32]{1,0} broadcast(iota.1439), dimensions={1}
  reshape.1441 = s32[2,32,1]{2,1,0} reshape(broadcast.1440)
  broadcast.1443 = s32[2,32,1]{2,1,0} broadcast(reshape.1441), dimensions={0,1,2}
  reshape.1444 = s32[2,32]{1,0} reshape(broadcast.1443)
  broadcast.1445 = s32[2,32,32]{2,1,0} broadcast(reshape.1444), dimensions={0,1}
  reshape.1442 = s32[2,1,32]{2,1,0} reshape(broadcast.1440)
  broadcast.1446 = s32[2,1,32]{2,1,0} broadcast(reshape.1442), dimensions={0,1,2}
  reshape.1447 = s32[2,32]{1,0} reshape(broadcast.1446)
  broadcast.1448 = s32[2,32,32]{2,1,0} broadcast(reshape.1447), dimensions={0,2}
  compare.1449 = pred[2,32,32]{2,1,0} compare(broadcast.1445, broadcast.1448), direction=GE
  reshape.1450 = pred[2,1,32,32]{3,2,1,0} reshape(compare.1449)
  convert.1455 = s32[2,1,32,32]{3,2,1,0} convert(reshape.1450)
  compare.1457 = pred[2,1,32,32]{3,2,1,0} compare(convert.1455, broadcast.54), direction=NE
  and.1458 = pred[2,1,32,32]{3,2,1,0} and(compare.1456, compare.1457)
  convert.1459 = f32[2,1,32,32]{3,2,1,0} convert(and.1458)
  constant.51 = f32[] constant(0)
  broadcast.52 = f32[2,1,32,32]{3,2,1,0} broadcast(constant.51), dimensions={}
  compare.1460 = pred[2,1,32,32]{3,2,1,0} compare(convert.1459, broadcast.52), direction=GT
  constant.49 = f32[] constant(-3.40282347e+38)
  broadcast.50 = f32[2,1,32,32]{3,2,1,0} broadcast(constant.49), dimensions={}
  select.1461 = f32[2,1,32,32]{3,2,1,0} select(compare.1460, broadcast.52, broadcast.50)
  broadcast.1542 = f32[2,1,32,32]{3,2,1,0} broadcast(select.1461), dimensions={0,1,2,3}
  reshape.1543 = f32[2,32,32]{2,1,0} reshape(broadcast.1542)
  broadcast.1544 = f32[2,12,32,32]{3,2,1,0} broadcast(reshape.1543), dimensions={0,2,3}
  add.1545 = f32[2,12,32,32]{3,2,1,0} add(broadcast.1541, broadcast.1544)
  add.1548 = f32[2,12,32,32]{3,2,1,0} add(dot.1547, add.1545)
  constant.112 = f32[] constant(-inf)
  reduce.1553 = f32[2,12,32]{2,1,0} reduce(add.1548, constant.112), dimensions={3}, to_apply=region_54.1552
  constant.41 = f32[] constant(-inf)
  broadcast.42 = f32[2,12,32]{2,1,0} broadcast(constant.41), dimensions={}
  maximum.1554 = f32[2,12,32]{2,1,0} maximum(reduce.1553, broadcast.42)
  reshape.1555 = f32[2,12,32,1]{3,2,1,0} reshape(maximum.1554)
  broadcast.1556 = f32[2,12,32,1]{3,2,1,0} broadcast(reshape.1555), dimensions={0,1,2,3}
  reshape.1557 = f32[2,12,32]{2,1,0} reshape(broadcast.1556)
  broadcast.1558 = f32[2,12,32,32]{3,2,1,0} broadcast(reshape.1557), dimensions={0,1,2}
  subtract.1559 = f32[2,12,32,32]{3,2,1,0} subtract(add.1548, broadcast.1558)
  exponential.1560 = f32[2,12,32,32]{3,2,1,0} exponential(subtract.1559)
  reduce.1565 = f32[2,12,32]{2,1,0} reduce(exponential.1560, constant.115), dimensions={3}, to_apply=region_55.1564
  reshape.1566 = f32[2,12,32,1]{3,2,1,0} reshape(reduce.1565)
  broadcast.1567 = f32[2,12,32,1]{3,2,1,0} broadcast(reshape.1566), dimensions={0,1,2,3}
  reshape.1568 = f32[2,12,32]{2,1,0} reshape(broadcast.1567)
  broadcast.1569 = f32[2,12,32,32]{3,2,1,0} broadcast(reshape.1568), dimensions={0,1,2}
  divide.1570 = f32[2,12,32,32]{3,2,1,0} divide(exponential.1560, broadcast.1569)
  dot.1571 = f32[2,12,64,32]{3,2,1,0} dot(reshape.1437, divide.1570), lhs_batch_dims={0,2}, lhs_contracting_dims={1}, rhs_batch_dims={0,1}, rhs_contracting_dims={3}
  transpose.1572 = f32[2,32,12,64]{1,3,2,0} transpose(dot.1571), dimensions={0,3,1,2}
  reshape.1573 = f32[2,32,768]{2,1,0} reshape(transpose.1572)
  constant.194 = f32[768,768]{1,0} constant({...})
  dot.1574 = f32[2,32,768]{2,1,0} dot(reshape.1573, constant.194), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  add.1575 = f32[2,32,768]{2,1,0} add(call.1413, dot.1574)
  constant.62 = f32[1,1,768]{2,1,0} constant({...})
  broadcast.1375 = f32[1,1,768]{2,1,0} broadcast(constant.62), dimensions={0,1,2}
  reshape.1376 = f32[768]{0} reshape(broadcast.1375)
  broadcast.1377 = f32[2,64,768]{2,1,0} broadcast(reshape.1376), dimensions={2}
  Arg_0.1 = s32[2,64]{1,0} parameter(0)
  call.345 = f32[2,64,768]{2,1,0} call(constant.116, Arg_0.1), to_apply=_take.344
  constant.106 = f32[1,1,768]{2,1,0} constant({...})
  broadcast.360 = f32[1,1,768]{2,1,0} broadcast(constant.106), dimensions={0,1,2}
  reshape.361 = f32[768]{0} reshape(broadcast.360)
  broadcast.362 = f32[2,64,768]{2,1,0} broadcast(reshape.361), dimensions={2}
  multiply.346 = f32[2,64,768]{2,1,0} multiply(call.345, call.345)
  reduce.351 = f32[2,64]{1,0} reduce(multiply.346, constant.115), dimensions={2}, to_apply=region_1.350
  reshape.352 = f32[2,64,1]{2,1,0} reshape(reduce.351)
  constant.109 = f32[] constant(768)
  broadcast.110 = f32[2,64,1]{2,1,0} broadcast(constant.109), dimensions={}
  divide.353 = f32[2,64,1]{2,1,0} divide(reshape.352, broadcast.110)
  constant.107 = f32[] constant(1e-06)
  broadcast.108 = f32[2,64,1]{2,1,0} broadcast(constant.107), dimensions={}
  add.354 = f32[2,64,1]{2,1,0} add(divide.353, broadcast.108)
  sqrt.355 = f32[2,64,1]{2,1,0} sqrt(add.354)
  broadcast.356 = f32[2,64,1]{2,1,0} broadcast(sqrt.355), dimensions={0,1,2}
  reshape.357 = f32[2,64]{1,0} reshape(broadcast.356)
  broadcast.358 = f32[2,64,768]{2,1,0} broadcast(reshape.357), dimensions={0,1}
  divide.359 = f32[2,64,768]{2,1,0} divide(call.345, broadcast.358)
  multiply.363 = f32[2,64,768]{2,1,0} multiply(broadcast.362, divide.359)
  constant.119 = f32[768,768]{1,0} constant({...})
  dot.366 = f32[2,64,768]{2,1,0} dot(multiply.363, constant.119), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  reshape.369 = f32[2,64,12,64]{3,2,1,0} reshape(dot.366)
  constant.117 = f32[768,768]{1,0} constant({...})
  dot.364 = f32[2,64,768]{2,1,0} dot(multiply.363, constant.117), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  reshape.367 = f32[2,64,12,64]{3,2,1,0} reshape(dot.364)
  constant.104 = f32[] constant(8)
  broadcast.105 = f32[2,64,12,64]{3,2,1,0} broadcast(constant.104), dimensions={}
  multiply.370 = f32[2,64,12,64]{3,2,1,0} multiply(reshape.367, broadcast.105)
  divide.457 = f32[2,64,12,64]{3,2,1,0} divide(multiply.370, broadcast.105)
  constant.118 = f32[768,768]{1,0} constant({...})
  dot.365 = f32[2,64,768]{2,1,0} dot(multiply.363, constant.118), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  reshape.368 = f32[2,64,12,64]{3,2,1,0} reshape(dot.365)
  dot.458 = f32[2,12,64,64]{3,2,1,0} dot(divide.457, reshape.368), lhs_batch_dims={0,2}, lhs_contracting_dims={3}, rhs_batch_dims={0,2}, rhs_contracting_dims={3}
  constant.120 = f32[32,12]{1,0} constant({...})
  iota.376 = s32[64]{0} iota(), iota_dimension=0
  reshape.377 = s32[1,64]{1,0} reshape(iota.376)
  broadcast.378 = s32[1,64]{1,0} broadcast(reshape.377), dimensions={0,1}
  reshape.379 = s32[64]{0} reshape(broadcast.378)
  broadcast.380 = s32[64,64]{1,0} broadcast(reshape.379), dimensions={1}
  iota.374 = s32[64]{0} iota(), iota_dimension=0
  reshape.375 = s32[64,1]{1,0} reshape(iota.374)
  broadcast.381 = s32[64,1]{1,0} broadcast(reshape.375), dimensions={0,1}
  reshape.382 = s32[64]{0} reshape(broadcast.381)
  broadcast.383 = s32[64,64]{1,0} broadcast(reshape.382), dimensions={0}
  subtract.384 = s32[64,64]{1,0} subtract(broadcast.380, broadcast.383)
  constant.96 = s32[] constant(0)
  broadcast.97 = s32[64,64]{1,0} broadcast(constant.96), dimensions={}
  compare.385 = pred[64,64]{1,0} compare(subtract.384, broadcast.97), direction=GT
  convert.386 = s32[64,64]{1,0} convert(compare.385)
  constant.94 = s32[] constant(16)
  broadcast.95 = s32[64,64]{1,0} broadcast(constant.94), dimensions={}
  multiply.387 = s32[64,64]{1,0} multiply(convert.386, broadcast.95)
  convert.410 = f32[64,64]{1,0} convert(multiply.387)
  abs.388 = s32[64,64]{1,0} abs(subtract.384)
  constant.92 = s32[] constant(8)
  broadcast.93 = s32[64,64]{1,0} broadcast(constant.92), dimensions={}
  compare.389 = pred[64,64]{1,0} compare(abs.388, broadcast.93), direction=LT
  convert.390 = f32[64,64]{1,0} convert(abs.388)
  constant.90 = f32[] constant(8)
  broadcast.91 = f32[64,64]{1,0} broadcast(constant.90), dimensions={}
  divide.391 = f32[64,64]{1,0} divide(convert.390, broadcast.91)
  log.392 = f32[64,64]{1,0} log(divide.391)
  constant.88 = f32[] constant(2.77258873)
  broadcast.89 = f32[64,64]{1,0} broadcast(constant.88), dimensions={}
  divide.393 = f32[64,64]{1,0} divide(log.392, broadcast.89)
  multiply.394 = f32[64,64]{1,0} multiply(divide.393, broadcast.91)
  add.395 = f32[64,64]{1,0} add(multiply.394, broadcast.91)
  constant.113 = s32[] constant(15)
  call.402 = f32[64,64]{1,0} call(add.395, constant.113), to_apply=clip.401
  call.409 = f32[64,64]{1,0} call(compare.389, abs.388, call.402), to_apply=_where_0.408
  add.411 = f32[64,64]{1,0} add(convert.410, call.409)
  convert.412 = s32[64,64]{1,0} convert(add.411)
  call.447 = f32[64,64,12]{2,1,0} call(constant.120, convert.412), to_apply=_take_1.446
  transpose.448 = f32[12,64,64]{0,2,1} transpose(call.447), dimensions={2,0,1}
  reshape.449 = f32[1,12,64,64]{3,2,1,0} reshape(transpose.448)
  broadcast.450 = f32[1,12,64,64]{3,2,1,0} broadcast(reshape.449), dimensions={0,1,2,3}
  reshape.451 = f32[12,64,64]{2,1,0} reshape(broadcast.450)
  broadcast.452 = f32[2,12,64,64]{3,2,1,0} broadcast(reshape.451), dimensions={1,2,3}
  Arg_1.2 = s32[2,64]{1,0} parameter(1)
  reshape.371 = s32[2,1,1,64]{3,2,1,0} reshape(Arg_1.2)
  constant.102 = s32[] constant(0)
  broadcast.103 = s32[2,1,1,64]{3,2,1,0} broadcast(constant.102), dimensions={}
  compare.372 = pred[2,1,1,64]{3,2,1,0} compare(reshape.371, broadcast.103), direction=GT
  constant.100 = f32[] constant(0)
  broadcast.101 = f32[2,1,1,64]{3,2,1,0} broadcast(constant.100), dimensions={}
  constant.98 = f32[] constant(-3.40282347e+38)
  broadcast.99 = f32[2,1,1,64]{3,2,1,0} broadcast(constant.98), dimensions={}
  select.373 = f32[2,1,1,64]{3,2,1,0} select(compare.372, broadcast.101, broadcast.99)
  broadcast.453 = f32[2,1,1,64]{3,2,1,0} broadcast(select.373), dimensions={0,1,2,3}
  reshape.454 = f32[2,64]{1,0} reshape(broadcast.453)
  broadcast.455 = f32[2,12,64,64]{3,2,1,0} broadcast(reshape.454), dimensions={0,3}
  add.456 = f32[2,12,64,64]{3,2,1,0} add(broadcast.452, broadcast.455)
  add.459 = f32[2,12,64,64]{3,2,1,0} add(dot.458, add.456)
  reduce.464 = f32[2,12,64]{2,1,0} reduce(add.459, constant.112), dimensions={3}, to_apply=region_3.463
  constant.86 = f32[] constant(-inf)
  broadcast.87 = f32[2,12,64]{2,1,0} broadcast(constant.86), dimensions={}
  maximum.465 = f32[2,12,64]{2,1,0} maximum(reduce.464, broadcast.87)
  reshape.466 = f32[2,12,64,1]{3,2,1,0} reshape(maximum.465)
  broadcast.467 = f32[2,12,64,1]{3,2,1,0} broadcast(reshape.466), dimensions={0,1,2,3}
  reshape.468 = f32[2,12,64]{2,1,0} reshape(broadcast.467)
  broadcast.469 = f32[2,12,64,64]{3,2,1,0} broadcast(reshape.468), dimensions={0,1,2}
  subtract.470 = f32[2,12,64,64]{3,2,1,0} subtract(add.459, broadcast.469)
  exponential.471 = f32[2,12,64,64]{3,2,1,0} exponential(subtract.470)
  reduce.476 = f32[2,12,64]{2,1,0} reduce(exponential.471, constant.115), dimensions={3}, to_apply=region_4.475
  reshape.477 = f32[2,12,64,1]{3,2,1,0} reshape(reduce.476)
  broadcast.478 = f32[2,12,64,1]{3,2,1,0} broadcast(reshape.477), dimensions={0,1,2,3}
  reshape.479 = f32[2,12,64]{2,1,0} reshape(broadcast.478)
  broadcast.480 = f32[2,12,64,64]{3,2,1,0} broadcast(reshape.479), dimensions={0,1,2}
  divide.481 = f32[2,12,64,64]{3,2,1,0} divide(exponential.471, broadcast.480)
  dot.482 = f32[2,12,64,64]{3,2,1,0} dot(reshape.369, divide.481), lhs_batch_dims={0,2}, lhs_contracting_dims={1}, rhs_batch_dims={0,1}, rhs_contracting_dims={3}
  transpose.483 = f32[2,64,12,64]{1,3,2,0} transpose(dot.482), dimensions={0,3,1,2}
  reshape.484 = f32[2,64,768]{2,1,0} reshape(transpose.483)
  constant.121 = f32[768,768]{1,0} constant({...})
  dot.485 = f32[2,64,768]{2,1,0} dot(reshape.484, constant.121), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  add.486 = f32[2,64,768]{2,1,0} add(call.345, dot.485)
  constant.85 = f32[1,1,768]{2,1,0} constant({...})
  broadcast.501 = f32[1,1,768]{2,1,0} broadcast(constant.85), dimensions={0,1,2}
  reshape.502 = f32[768]{0} reshape(broadcast.501)
  broadcast.503 = f32[2,64,768]{2,1,0} broadcast(reshape.502), dimensions={2}
  multiply.487 = f32[2,64,768]{2,1,0} multiply(add.486, add.486)
  reduce.492 = f32[2,64]{1,0} reduce(multiply.487, constant.115), dimensions={2}, to_apply=region_5.491
  reshape.493 = f32[2,64,1]{2,1,0} reshape(reduce.492)
  divide.494 = f32[2,64,1]{2,1,0} divide(reshape.493, broadcast.110)
  add.495 = f32[2,64,1]{2,1,0} add(divide.494, broadcast.108)
  sqrt.496 = f32[2,64,1]{2,1,0} sqrt(add.495)
  broadcast.497 = f32[2,64,1]{2,1,0} broadcast(sqrt.496), dimensions={0,1,2}
  reshape.498 = f32[2,64]{1,0} reshape(broadcast.497)
  broadcast.499 = f32[2,64,768]{2,1,0} broadcast(reshape.498), dimensions={0,1}
  divide.500 = f32[2,64,768]{2,1,0} divide(add.486, broadcast.499)
  multiply.504 = f32[2,64,768]{2,1,0} multiply(broadcast.503, divide.500)
  constant.122 = f32[768,3072]{1,0} constant({...})
  dot.505 = f32[2,64,3072]{2,1,0} dot(multiply.504, constant.122), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  call.511 = f32[2,64,3072]{2,1,0} call(dot.505), to_apply=relu.510
  constant.123 = f32[3072,768]{1,0} constant({...})
  dot.512 = f32[2,64,768]{2,1,0} dot(call.511, constant.123), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  add.513 = f32[2,64,768]{2,1,0} add(add.486, dot.512)
  constant.84 = f32[1,1,768]{2,1,0} constant({...})
  broadcast.528 = f32[1,1,768]{2,1,0} broadcast(constant.84), dimensions={0,1,2}
  reshape.529 = f32[768]{0} reshape(broadcast.528)
  broadcast.530 = f32[2,64,768]{2,1,0} broadcast(reshape.529), dimensions={2}
  multiply.514 = f32[2,64,768]{2,1,0} multiply(add.513, add.513)
  reduce.519 = f32[2,64]{1,0} reduce(multiply.514, constant.115), dimensions={2}, to_apply=region_6.518
  reshape.520 = f32[2,64,1]{2,1,0} reshape(reduce.519)
  divide.521 = f32[2,64,1]{2,1,0} divide(reshape.520, broadcast.110)
  add.522 = f32[2,64,1]{2,1,0} add(divide.521, broadcast.108)
  sqrt.523 = f32[2,64,1]{2,1,0} sqrt(add.522)
  broadcast.524 = f32[2,64,1]{2,1,0} broadcast(sqrt.523), dimensions={0,1,2}
  reshape.525 = f32[2,64]{1,0} reshape(broadcast.524)
  broadcast.526 = f32[2,64,768]{2,1,0} broadcast(reshape.525), dimensions={0,1}
  divide.527 = f32[2,64,768]{2,1,0} divide(add.513, broadcast.526)
  multiply.531 = f32[2,64,768]{2,1,0} multiply(broadcast.530, divide.527)
  constant.126 = f32[768,768]{1,0} constant({...})
  dot.534 = f32[2,64,768]{2,1,0} dot(multiply.531, constant.126), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  reshape.537 = f32[2,64,12,64]{3,2,1,0} reshape(dot.534)
  constant.124 = f32[768,768]{1,0} constant({...})
  dot.532 = f32[2,64,768]{2,1,0} dot(multiply.531, constant.124), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  reshape.535 = f32[2,64,12,64]{3,2,1,0} reshape(dot.532)
  multiply.538 = f32[2,64,12,64]{3,2,1,0} multiply(reshape.535, broadcast.105)
